作業目標:<br>
1. 敘述統計量計算<br>
2. 運用自定義函數apply

作業重點:<br>
1. 了解敘述統計量並解釋<br>
2. 運用apply時須注意自定義函數寫法

題目<br>
對以下成績資料做分析<br>
1. 6號學生(student_id=6)3科平均分數為何?<br>
2. 6號學生3科平均分數是否有贏過班上一半的同學?<br>
3. 由於班上同學成績不好，所以學校統一加分，加分方式為開根號乘以十，請問6號同學3科成績分別是?<br>
4. 承上題，加分後各科班平均變多少?
<br>
score_df = pd.DataFrame([[1,56,66,70], 
              [2,90,45,34],
              [3,45,32,55],
              [4,70,77,89],
              [5,56,80,70],
              [6,60,54,55],
              [7,45,70,79],
              [8,34,77,76],
              [9,25,87,60],
              [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])

In [62]:
import pandas as pd
score_df = pd.DataFrame([[1,56,66,70], 
              [2,90,45,34],
              [3,45,32,55],
              [4,70,77,89],
              [5,56,80,70],
              [6,60,54,55],
              [7,45,70,79],
              [8,34,77,76],
              [9,25,87,60],
              [10,88,40,43]],columns=['student_id','math_score','english_score','chinese_score'])
score_df = score_df.set_index('student_id')
score_df

            math_score  english_score  chinese_score
student_id
1                   56             66             70
2                   90             45             34
3                   45             32             55
4                   70             77             89
5                   56             80             70
6                   60             54             55
7                   45             70             79
8                   34             77             76
9                   25             87             60
10                  88             40             43

In [49]:
#1.6號學生(student_id=6)3科平均分數為何?

score = score_df.loc[6,:].mean()

print(f"6號學生3科平均為{score: .2f}")

6號學生3科平均為 56.33

In [66]:
score_df.math_score

student_id
1     56
2     90
3     45
4     70
5     56
6     60
7     45
8     34
9     25
10    88
Name: math_score, dtype: int64

In [73]:
#2. 6號學生3科平均分數是否有贏過班上一半的同學
score_df["mean"] = score_df.mean(axis=1)
score_df

            math_score  english_score  chinese_score       mean
student_id
1                   56             66             70  64.000000
2                   90             45             34  56.333333
3                   45             32             55  44.000000
4                   70             77             89  78.666667
5                   56             80             70  68.666667
6                   60             54             55  56.333333
7                   45             70             79  64.666667
8                   34             77             76  62.333333
9                   25             87             60  57.333333
10                  88             40             43  57.000000

In [74]:
(score > score_df["mean"] ).sum()

1

In [ ]:
#6號學生僅有贏過一個學生 並沒有班上一半學生

In [76]:
#由於班上同學成績不好，所以學校統一加分，加分方式為開根號乘以十，請問6號同學3科成績分別是?
score_edit =score_df.loc[6,:].apply(lambda x: x**(1/2)*10)

for i, j in score_edit.iteritems():
    print(f"{i}成績經加分後為{j: .2f}")

math_score成績經加分後為 77.46
english_score成績經加分後為 73.48
chinese_score成績經加分後為 74.16
mean成績經加分後為 75.06

In [77]:
#承上題，加分後各科班平均變多少
score_df.apply(lambda x: x**(1/2)*10, axis=1 )

            math_score  english_score  chinese_score       mean
student_id
1            74.833148      81.240384      83.666003  80.000000
2            94.868330      67.082039      58.309519  75.055535
3            67.082039      56.568542      74.161985  66.332496
4            83.666003      87.749644      94.339811  88.694231
5            74.833148      89.442719      83.666003  82.865353
6            77.459667      73.484692      74.161985  75.055535
7            67.082039      83.666003      88.881944  80.415587
8            58.309519      87.749644      87.177979  78.951462
9            50.000000      93.273791      77.459667  75.718778
10           93.808315      63.245553      65.574385  75.498344